"{\"id\":1876,\"parentExerciseId\":null,\"name\":\"What is Scraping?\",\"slug\":\"web-scraping__what-is-scraping\",\"sequenceNum\":4000,\"reviewType\":\"peer\",\"content\":\"```ngMeta\\nname: What is Scraping?\\n```\\n\\n# Introduction\\n\\nHow can we scrape in Python?\\n- HTML is rendered by browsers. But we can get the same HTML in Python using requests. Show how to install requests.\\n- Print the same HTML in the Terminal which you got.\\n- Install BeautifulSoup and show how we can get the title and a few other tags to give a basic glimpse into BeautifulSoup of a page using Beautiful Soup?\\n\\n# Packages need to Scrape Data and why we use them\\nWhat is pip?\\n- Hum pip ko install iss liye krte hai because it is a package management system jisse ki help karta hai python ke Module ko - install karne main.\\n- pip is a package management system used to install and manage software packages written in Python.\\n\\nWhy we use module requests?\\n- Hum yha moduale requesta ka use is liye krte hai ki hum jis web page ko scrape kr rhe hai to requests humko ek sample data collect kr dega.\\n- we use import the Requests module so that we can collect a sample web page:\\n\\nWhy we use pip install beautifulsoup4?\\n- Beautifulsoup4 yeh ek python package hai jo ki HTML and xml Document ko parse prta hai\\n- Beautiful Soup is a Python package for parsing HTML and XML documents.\\n\\nhow to install these packages\\n```\\n   $ sudo apt-get install python3-pip\\n   $ pip install requests Or pip --use requests\\n   $ pip install beautifulsoup4\\n   \\n```\\n\\n@[youtube](https://www.youtube.com/watch?v=c7rnimpwF8o)\\n\\n# Let's start\\nSabse phle humko [some important things](https://www.pythonforbeginners.com/beautifulsoup/beautifulsoup-4-python) ke bare main pata hona chahiye.\\n\\n@[youtube](https://www.youtube.com/watch?v=jAQEPbo0oEQ)\\n \\n```\\nStep 1. import requests\\nStep 2. URL = \\\"Yha per apka url hoga jis bhi web page ko aap scrape karna chahte ho\\\"\\nStep 3. sample = requests.get(URL) #ye hamare webpage ka sample Download kr dega\\nStep 4. from bs4 import BeautifulSoup\\nStep 5. soup = BeautifulSoup(sample.text,\\\"html.parser\\\") # iss object ke throw hum kahi bhi khel sakte hai\\nStep 6. Title = soup.title\\n\\nprint(Title)#ye apke web page ka title print karega\\n```\\nAb aap yha se scraping start karenge ..............\\n\\n\\n\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/web-scraping/what-is-scraping.md\"}"