"{\"id\":1059,\"parentExerciseId\":null,\"name\":\"More about Booleans\",\"slug\":\"python__more-booleans\",\"sequenceNum\":14000,\"reviewType\":\"peer\",\"content\":\"```ngMeta\\nname: More about Booleans\\n```\\n\\n# Introduction\\n\\nAbhi tak humne yeh padha hai ki booleans ek special type ke data types hote hain. Jaise `integer` aur `float` mein numbers aur `string` mein kuch bhi aa sakta hai. Waise hi `booleans` mein sirf `True` ya `False` aa sakta hai.\\n\\nPython mein hum `type` function ka use kar ke kisi bhi value ki type dekh sakte hain.\\n\\n```python\\nnumber1 = 124\\ntype(number1) # yeh int karega. `int` ka matlab integer hota hai.\\n\\nnumber2 = 123.4\\ntype(number2) # float\\n\\nstring1 = \\\"NavGurukul\\\"\\ntype(string1) # str\\n\\nx = True\\ntype(x) # bool. iska matlab boolean hota hai\\ntype(4 < 5) # socho iska javab bool kyun aata hai?\\n```\\n\\n# If Conditions & Booleans\\n\\nProgrammign mein computer ko apni baat samjhane ke liye hume usse batana padta hai ki kya karna hai. Iske liye hume computer ka batana padhta hai ki alag alag conditons mein alag alag kaam karna hai. Jaise:\\n\\n1. Lift ke andar ka computer 1 dabane pe 1st floor pe lift ko rok deta hai aur 2 dabane par 2nd floor pe.\\n2. WhatsApp message padhe ya nah pade jane par blue ya gray tick dikhata hai.\\n\\nAisi conditions likhne ke liye humne if statements ka use karna seekha hai pichle sections. If statements booleans ka use karti hai. Yaad karo ki if statements mein hum kuch comparison operators ka use karte the:\\n\\n1. `<`\\n2. `<=`\\n3. `>`\\n4. `>=`\\n5. `>`\\n6. `!=`\\n\\nYeh saare comparison operators kuch sawal puchte hain. Jaise\\n\\n```python\\nnumber1 = 45\\nnumber2 = 56\\nif number2 > number1:\\n\\tprint \\\"Bada hai number2\\\"\\nelse:\\n\\tprint \\\"Number 2 bada nahi hai\\\"\\n```\\n\\nYahan `>` ek saval puch raha hai. Woh saval hai **Kya number2 number1 se bada hai?** Dhyan se dekho iss saval ke sirf do javab ho sakte hain:\\n\\n1. Haan / Yes / True\\n2. Nahi / No / False\\n\\nJab iss saval ka javab haan hota hai toh `>` ka output True hota hai aur jab nahi hota hai toh `>` ka output False hota hai. Aur if statement True ya False ke hisaab se code ko execute karti hai. Agar javab True hai toh if ke andar wala code chalega nahi toh else ka andar wala code chalega.\\n\\nYeh code chala ke dekho.\\n\\n```python\\nif True:\\n\\tprint \\\"Only I will run\\\"\\nelse:\\n\\tprint \\\"I will never run\\\"\\n```\\n\\nYahan dekho ki humesha `Only I will run` waali line print hoyegi, kyunki humne direct if ke aage True laga diya hai. If ko humesha True milega aur woh hi chalega.\\n\\n**Note: Aise code likh kar if-elif-else ke saath try karo aur apne saath waalon ke saath discuss karo.**\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/python/more-booleans.md\"}"