"{\"id\":1041,\"parentExerciseId\":1041,\"name\":\"What are loops?\",\"slug\":\"python__loops-flowchart/loops-intro\",\"sequenceNum\":17000,\"reviewType\":\"peer\",\"content\":\"```ngMeta\\nname: What are loops?\\n```\\n\\n# What are loops?\\n\\nAgar aapko bola jaye ki ek **flowchart** banao jo **5 baar** \\\"Navgurukul\\\" print kare. Tab aap aisa kuch karenge.\\n\\n![5 time print](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/17005/17000/qh2rza.12-image1.png)\\n\\nSocho agar aapko 1000 baar kuch print karna hai ya koi bhi same kaam bar bar karna hai? Tab kya aap **baar baar** print statement likhoge? Basically jab bhi hum ek kaam ko baar baar ek hi dhang se karte hain usko iteration kehte hain aur yeh karne mein loops humari help karte hain.\\n\\nAise kaam karne ke liye hum **loop** ka use karte hai. **Loop** se aise kaam karna easy ho jata hai. Chalo ab dekhte hai ki loop kaise likhte hai. Aur loop kaise chalta hai. Neeche diye flowchart ko ek baar pehle khud samjhne ki koshish karna. Aisa ho sakta hai ki aap isse khud hi samajh jaye.\\n\\nAgar humne loops ke saath karna hai toh hum aisa flowchart banayenge.\\n\\n![use loop ](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/17005/17000/zyebde.12-image2.png)\\n\\nYeh flowchart neeche diye gaye steps ke hisaab se kaam karta hai:\\n\\n1. Humne counter ko 0 se shuru kiya. **Counter** se hum count karenge ki hum kitni baar print kar chuke hai.\\n2. Aur fir check kiya - **Kya counter 5 se kam hai?**\\n3. Abhi counter ki value 0 hai. Yeh condition **True** hogi aur navgurkul print ho jayega.\\n4. Uske baad hum counter ki value ko ek se bada denge. Aur phir se if statement par chale jayenge. Yeh \\t\\tcondition phir se true ho jayegi kyunki 1, 5 se chota hai. Aur ek baar aur navgurukul print ho jayega.\\n5. Aisa tab tak hota rahega jab tak counter ki value 5 nahi ho jaati. Uske baad If ki condition **False** ho \\t\\tjayegi (kyuki 5, 5 ke equal hai). Aur hum rukk jayenge. \\n\\n\\nIsko hum **loop** bolte hai. Loop matlab kisi cheez ko baar baar karna. Jaise agar hume ek ek glass ko bhar kar, usse matka bharna hai, toh hume woh baar baar karna hoga.\\n\\nAbhi agle kuch sections mein hum loops ke flowcharts banana seekenge. Ek baar hum woh sahi se seekh lein, fir hum loops ka code likhna bhi seekhenge.\\n\\n<span>loop ke bare main aur janane ke liye yaha</span><a href=\\\"http://automatetheboringstuff.com/chapter2/\\\">Clike kare</a>\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/python/loops-flowchart/loops-intro.md\"}"