"{\"id\":1047,\"parentExerciseId\":1047,\"name\":\"Functions\",\"slug\":\"python__functions/functions-intro\",\"sequenceNum\":22000,\"reviewType\":\"peer\",\"content\":\"```ngMeta\\nname: Functions\\n```\\n\\n# Basics of Functions\\n\\nAise hi python mein hum functions ka use kar ke hum ek baar kuch code likh ke usko bahot baar use kar sakte hain. Isse humara kaam bahot aasan ho jata hai.\\n\\n```python\\nprint “NavGurukul”\\n\\ndef say_hello():\\n    print “Hello!”\\n    print “Aap kaise ho?”\\n\\nsay_hello()\\nprint “Python is awesome”\\nsay_hello()\\nprint “Hello…”\\nsay_hello()\\n```\\n\\nIsko chala ke dekho. Iski output kuch aisi aayegi:\\n\\n```\\nNavGurukul\\nHello\\nAap kaise ho?\\nPython is awesome\\nHello\\nAap kaise ho?\\nHello...\\nHello\\nAap Kaise ho?\\n```\\n\\nDhayn se dekho ki code mein jahan bhi `say_hello()` likha hai, wahan `Hello!` aur `Aap kaise ho?` waali lines print ho gayi hain. Yeh isliye hua hai kyunki humne ek baar doosri line mein `def say_hello()` ka use kar ke ek function likh diya. Ab jab bhi yeh function call hoga toh iske andar waala code chal jayega. Iss tareeke se hum baar baar ek code ko user kar sakte hain.\\n\\n# Introduction to Functions\\n\\nFunctions ka use karke hum kuch code ek baar likh ke usse baar baar wahi kaam karva sakte hain. Aap abhi tak bahot functions ka use kar chuke ho. Iss code ko padho:\\n\\n```python\\nnames_list = [“Fiza”, “Shivam”, “Imtiyaz”, “Deepanshu”, “Rahman”]\\nprint len(names_list)\\n```\\n\\nYahan `len(names_list)` ka use kar ke humne jana ki list mein kitne item hai. Ab hum apne code mein `len` ka use kar kisi bhi list ke items ki ginti kar sakte hain. Yahan `len` ek function hai. Functions ke bina humein list ki items ki ginti nikalne ke liye baar baar code likhna padega. Isko behtar samajhne hum aage wale examples mein iska code khud likhenge.\\n\\nHum ek function likhenge. Iss code ko pehle chala ke dekho, aur fir neeche padiye iske baare mein samajhne ke liye.\\n\\n```python\\ndef definition_say_hello():\\n    print \\\"NavGurukul\\\"\\n    print \\\"NavGurukul mei humein apni learning ki responsibility leni padti hai.\\\"\\n\\ndefinition_say_hello()\\n\\nprint \\\"NavGurukul mei hum sab logo ko ek tarah se treat karte hai.\\\"\\n\\ndefinition_say_hello()\\n```\\n\\nEk aur example FUNCTIONS samajhne ke liye. Iss code ko padh ke output socho. Chala ke dekhne ke baad dhyan se padho.\\n\\n1. Shuruat mein `def` ka use kar ke hum python ko bata rahe ki humne ek `definition_say_hello` naam ka function likha hai.\\n![](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/22007/22000/jvlbqn.function_defn_inst_1.png)\\n2. Iss function ka code (do print karne ki lines) kuch indent (space) deke `def definition_say_hello()` ke neeche likha hua hai. Inn spaces se python samajh jata hai ki yeh function ka code hai.\\n![](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/22007/22000/nv01km.function_defn_inst_2.png)\\n3. Fir agli line, `definition_say_hello()` mein humne function ko bulaya hai jisse function ke andar wala code chal jata hai. Isko **FUNCTION CALL** karna kehte hain.\\n![](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/22007/22000/o988a7.function_defn_inst_3.png)\\n4. Iske baad print statement use kar ke humne ek string print kiya hai.\\n![](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/22007/22000/auk17f.function_defn_inst_4.png)\\n5. Aakhir mein humne firse `definition_say_hello()` likh ke function call ki hai. Ek aur baar function ek baar andar wale code ko chala deti hai. Isse andar waali jo function ke andar code hai - yaani - *2 print* command chal jati hai.\\n![](https://s3.ap-south-1.amazonaws.com/saralng/Basics__of__Programming__using__Python/22007/22000/eq7nyr.function_defn_inst_5.png)\\n6. Yahan yeh dekho ki kaise `NavGurukul delhi mein hai` ke upar aur neeche `definition_say_hello()` ke andar wali print command ki values print hue hain.\\n\\n```python\\ndef function_say_bye():\\n    print \\\"Aapko mil ke maza aaya. \\\"\\n    print \\\"Bye bye\\\"\\nfunction_say_bye()\\nfunction_say_bye()\\nprint \\\"Python ka istamaal bahot jagah hota hai.\\\"\\nfunction_say_bye()\\nfunction_say_bye()\\n```\\n\\n1. Hum python mein `def` keyword ka use kar ke function banate hain. `def` ke baad function ka naam, `function_say_bye` likha hain. Naam ke baad hum do bracket `(` `)` lagate hain.\\n2. Bracket ke baad ek colon, `:` lagate hain. Python semicolon se samajh jaati hai ki function ka code shuru ho raha hai.\\n3. Dekhiye ki sara function ka code indent (space) deke likha hua hai. Isse python ko samajh aata hai ki yeh function ke andar ka code hai.\\n4. `print \\\"Bye bye\\\"` ke baad code space diye bina likha hua hai. Isse python ko samajh aati hai ki function ka code kahatam ho gaya hai\\n5. functions ko bhi variables ko naam dene ke rules ke hisaab se hi naam dete hain. yaad rakhne ke liye ek baar variables ko naam dene ke rules yaad rakh li jiye.\\n\\n# FUNCTION CALLS ko samajhna\\n\\nNeeche diye gaye code ko likhiye aur dekhiye ki iska koi output aa raha hai ya nahi. Nahi aa raha toh kyun nahi aa rahi?\\n\\n```python\\ndef definition_hello_again():\\n    print \\\"Firse Hello :)\\\"\\n    print \\\"Aap kaise ho?\\\"\\n```\\n\\nAb apne code mein yeh line add karein aur dekhein ki koi output aati hai.\\n\\n```python\\ndefinition_hello_again()\\n```\\n\\nPython mein sirf function likh dene se function ka code chalta nahi hai. Yahan pehle humne def keyword ka use karke python ko function ka code bataya. Isko **\\\"FUNCTION DEFINITION\\\"** kehte hain.\\n\\nFir humne baad mein `definition_hello_again()` likh ke function ko bulaya aur usme likha hua code chalwaya. Isko **\\\"FUNCTION CALL\\\"** karna kehte hain. **\\\"FUNCTION CALL\\\"** mein hum function ke naam ke baad 2 bracket `(` `)` lagate hain. Isse python ko pata chalta hai ki function ke andar ka code chalana hai.\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/python/functions/functions-intro.md\"}"