"{\"id\":1055,\"parentExerciseId\":null,\"name\":\"Kaise shuru karein?\",\"slug\":\"python__how-to-begin\",\"sequenceNum\":4000,\"reviewType\":\"peer\",\"content\":\"```ngMeta\\nname: Kaise shuru karein?\\n```\\n\\n# Iss course ko kaise use karein?\\n\\nPython kaise use karte hai, iss video ko dekh kar samjhe\\n\\n@[youtube](ccPrUbz1oto) \\n\\nAage chal ke saare course mein har jagah alag alag tareeke se python ke code ke examples diye gaye hain. Inn examples ko aapko *python shell* mei chala kar dekhna padega. \\n\\nAb app apne laptop pe *python shell* khol le.\\n```sh\\n$ python\\n```\\n\\n```python\\n\\nprint \\\"Yeh python mein print hoga\\\"\\nprint \\\"Yeh ek aur line print hoyegi\\\"\\nprint 2 + 5\\ni = 0\\nprint i\\nwhile i < 100:\\n    print \\\"Main baar baar print hounga :)\\\"\\n\\n```\\nAb upar diye gaye code ko select karke Ctrl + C jishe yeh code copy hojyega aur phir app ishe Terminal pe jake Ctrl + Shift + V dabake paste karsakte hai.\\n\\nApp agar ish tarike se thod thod kar chalao toh apko madad milegi ek ek line ko sahi \\ntarike se samjhne meh.\\n\\nYeh ek pura code hai joh 4-5 alag kaam kar raha hai ishe thorke kese samjhe sakte ho uska tarike joh aage apko bohut kaam ayega niche diya gaya hai.\\n\\n\\n\\nYeh phela line ishe terminal pe chalaye kuch dikh raha hoga apko Terminal pe.\\n```python\\nprint \\\"Yeh python mein print hoga\\\"\\n```\\n\\nYeh dusra code ko Terminal pe chalaye aur dekhe kya dikh raha ha apko?\\n```python\\nprint \\\"Yeh ek aur line print hoyegi\\\"\\n```\\n\\nAb yeh line alag se chalao app Terminal pe aur dekho kya ho raha hai?\\n```python\\nprint 2 + 5\\n```\\n\\nAb yeh ek saat copy paste karo Terminal pe aur kya ho raha hai?\\n```python\\nprint \\\"Yeh python mein print hoga\\\"\\nprint \\\"Yeh ek aur line print hoyegi\\\"\\nprint 2 + 5\\n```\\n\\nIsh line me kya ho raha ha yeh apko aage samjh ayega lekin ishe chala ke thoda sa app khud bi samjhne ki kosish kare ishe.\\n```python\\ni = 0\\nprint i\\n```\\n\\nIshe copy paste kare Terminal pe aur ishe rokhne ke liye keyboard me Ctrl + C saat me dabaye Terminal pe.\\n```python\\ni = 0\\nwhile i < 100:\\n    print \\\"Main baar baar print hounga :)\\\"\\n```\\n\\nAur ab yeh chalaiye aur kya apko upar aur niche wale ke bich me kuch antar ka pata lagye?\\n```python\\ni = 0\\nwhile i < 100:\\n    print \\\"Main baar baar print hounga :)\\\"\\n    i = i+1\\n```\\n\\n\\nAb ishe ekata chalaye aur ishe rokhne ke liye app kya karenge?\\n```python\\nprint \\\"Yeh python mein print hoga\\\"\\nprint \\\"Yeh ek aur line print hoyegi\\\"\\nprint 2 + 5\\ni = 0\\nprint i\\nwhile i < 100:\\n    print \\\"Main baar baar print hounga :)\\\"\\n```\\nAb yeh sochiye upar wale code ko chalte rehne se rokhne ke liye app kya karenge?\\n\\nIss tareeke se pure course mein code likha hoga. Iss code ko aapko chalake dekhna padega. Isko chalane ke liye aapko Terminal naam ka application\\napne laptop pe kholna padega. Usko khol ke usme yeh type kar ke python chalani padega.\\n\\n\\n\\n## Bahot Important Rules\\n- Har ek example ko *python shell* mei execute kar kar dekhe. Agar aap yeh nahi kar rahe, toh apne aap ko bevkoof bana rahe ho.\\n- Code ko copy-paste karke chalane se aap seekh nahi payenge dhang se. Aapko har code ko apne haath se chala ke dehna chaiye.\\n- UPPER CASE ya **bold letters** mei likhe hue shabd kaafi important hai. Unhe yaad kar lo, woh aapko baar baar milenge.\\n- Course mein bahot jagah aapko kuch questions ka javab dena hoga. Javab dene ke liye aap humesha file upload kar sakte hain.\\n\\n\\n\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/python/how-to-begin.md\"}"