"{\"id\":1815,\"parentExerciseId\":1815,\"name\":\"Definitions Part 1\",\"slug\":\"python__basic-definition/definitions-part-1\",\"sequenceNum\":3000,\"reviewType\":\"peer\",\"content\":\"# Basic Definitions\\n### Data \\nComputer stores and process numbers, letters words and symbols are ofted called data. In a simple terms raw fact and figurs are called data.\\n### Program\\nThe task of processing of data is accomplished by executing a sequence of precise instructions called program.\\nOr simply you can say set of instructions that perform specific task is called program.\\n### Syntax\\nThe instructionsare formed using certain symbols and words according to some rigid rules known as syntax.\\nEvery programming language have slighly different syntax.\\n### Algorithms\\nAn algorithms is a complete, detailed and precise step-by-step method of solving a problem. It instruct the computer what specific steps it needs to perform to carry out particular task to solve a problem.\\n### Flowchart\\nTo visualize the working of an algorithms, one needs to take the help of flow chart, which is pictorial representation of algorithms depicting the flow of various steps.\\n### Flow of control / Control Flow\\nIt is the order in which individual statements, instructions or function calls of an imperative program are executed or evaluated. \\n### Binary Number\\nIt is a language made up of combinations of 0s and 1s. Each character on you're keyboard has a unique binary representation that distinguishes the character from the rest.Binary (“machine language”) is referred to as a “low-level language.” It’s considered to be “low-level” because it is a language that machines understand.\\n### High-Level-Language \\nProgrammers type there programs in a programming language.\\nA programming language is referred to as a “high-level language” since it is a language that humans can read and understand.\\n### Programming\\nIt is the process of designing and building an executable computer program for accomplishing a specific computing task. Programming involves tasks such as analysis, generating algorithms, writing code, debuging and implementing it.\\n### Client\\nA client is a piece of computer hardware or software that accesses a service made available by a server. The server is often on another computer system, in which case the client accesses the service by way of a network. \\n### Server\\nA server is a type of computer or device on a network that manages network resources. Servers are often dedicated, meaning that they perform no other tasks besides there server tasks.\\n### Front-end\\nFront-end web development is the practice of converting data to graphical interface for user to view and interact with data through digital interaction using HTML, CSS, Javascript.\\n### Back-end\\nBack end Development refers to the server side of development where you are primarily focused on how the site works. Making updates and changes in addition to monitoring functionality of the site will be you're primary responsibility.\\n### Icon\\nIcon is a small visual display of an application which can be activated by clicking on it.\\n### Internet\\nInternet is a network that accommodates several computers to facilitate exchange and transfer of data.\\n### Memory\\nMemory is the internal storage location where data and information is stored on a computer.\\n### Network\\nA Network is a group of computers connected to each other in order to send and receive data.\\n### Operating System\\nAn Operating System provides the software platform required for various applications to run on. It's responsibility is to manage memory storage and security of Data.\\n### Protocol\\nProtocol refers to a set of rules that are followed by two devices while interacting with each other.\\n### Quary\\nQuery is a request made by a computer from a database residing in the same system or a remotely located system.\\n### URL\\nURL stands for Universal Resource Locator. It’s a way of accessing the Internet. URL is the address of a resource on the Internet. A URL indicates the location of a resource as well as the protocol used to access it. \\n### ZIP\\nZIP is an acronym for Zone Information Protocol. ZIP application enables transfer of data using compression of files.\\n### Statement\\nA command line that ends with a semicolon.\\n### Source Code\\nSource code is the set of instructions and statements written by a programmer using a computer programming language. This code is later translated into machine language by a compiler. The translated code is referred to as object code.\\n### Libaray\\nThere are inbuilt functions which are grouped together and placed in a common place called library. Each library performs specific operation. We can make use of these library to get the pre-defined block of codes instead of writing our own code to get those outputs by importing it in our program. Ex. Math, Random, etc.\\n### Directory\\nThe files and folders on Linux system are arranged in what way is called a hierarchical directory structure. This means that they are organie in an areas on a hard disk in which files can be stored and organized.\\n \\n\",\"submissionType\":null,\"githubLink\":\"https://github.com/navgurukul/newton/tree/master/python/basic-definition/definitions-part-1.md\"}"